package Text;

public class Thinking {
    /*
    1. 메인화면
    게임 이름
    게임 시작
    게임 설정

    2. 게임 설정
    게임 사운드 조절
    게임 도감 (장비 / 몹 설명)
    게임 맵

    3. 게임 시작
    텍스트 진행
    이동 선택지 요구
    이동 후 해당 역 이벤트 발생
    이벤트 후 이동 선택지 요구
    발견한 역 온오프 활성화
    *상시 맵 열람 기능

    => 맵 구조
    이동 관련 기능
    이동 시 맵 활성화(지도 확장)
    한 호선 전부 활성화 시 내부 연결 활성화 기능

    => 이벤트
    해당 역마다 생성 필요
    전투 / 힐 / 장비 / 혹은 트리거

    => 전투
    턴제 방식
    몹은 강공, 방어 준비를 연달아 쓸 수 없으며 횟수제한이 있음
    보스 전용기는 전용 택틱으로 조건부 달성시 바로 사용
    유저는 선택지에 연속제한이 없이 자유로움

    몹 = 일반 공격 / 강 공격 / 방어 준비 (살살맞기/공격불가) / *보스 전용기
    유저 = 일반 공격 / 방어 (무적) / 방어깨기 (방어 준비 상대 시 댐증) / *빈칸 r 스킬(파밍으로 획득)

    => 체력
    전체 체력, 공격력, 선공도
    *크리티컬은 계산 어려움으로 제외
    체력 상황은 영구적으로 지속

    1. 고려사항
    맵 이동 구조를 어떻게 할 것인가...
    맵 막힘을 시스템적으로 어떻게 구성할 것인가


     */
}
